carlosgeos/avr-nrf24/atmega-rx/main.c
#define F_CPU 8000000UL

#include <avr/io.h>
#include <inttypes.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "nRF24L01P.h"

#define LED       PB1
#define RELAY     PD7
#define SPI_MOSI  PB3
#define SPI_MISO  PB4
#define SPI_CLK   PB5
#define NRF_CS    PB2
#define _NRF_CS_L cbi(PORTB, NRF_CS);
#define _NRF_CS_H sbi(PORTB, NRF_CS);
#define NRF_CE    PD0
#define _NRF_CE_L cbi(PORTD, NRF_CE);
#define _NRF_CE_H sbi(PORTD, NRF_CE);
#define cbi(sfr, bit) (_SFR_BYTE(sfr) &= ~_BV(bit)) // clear bit
#define sbi(sfr, bit) (_SFR_BYTE(sfr) |= _BV(bit))  // set bit
#define NRF_RX_CONF (NRF_PWR_UP + NRF_EN_CRC + NRF_PRIM_RX)

void setup(void);
void loop(void);
int main(void);
uint8_t spi_transfer(uint8_t data);

uint8_t nrfStatus = 0;
char rx_payload[10];

void activate_relay() {
    sbi(PORTD, RELAY);
    _delay_ms(100);
    cbi(PORTD, RELAY);
}

ISR(INT0_vect) {
    /* Quit RX mode */
    _NRF_CE_L;

    /* read payload */
    _NRF_CS_L;
    spi_transfer(NRF_R_RX_PAYLOAD);
    rx_payload[0] = spi_transfer(NRF_NOP);
    rx_payload[1] = spi_transfer(NRF_NOP);
    _NRF_CS_H;

    /* Clear receive bit */
    _NRF_CS_L;
    spi_transfer(NRF_W_REGISTER | NRF_STATUS);
    spi_transfer(0x40);
    _NRF_CS_H;

    activate_relay();
}


uint8_t spi_transfer(uint8_t data) {
    SPDR = data;
    while (!(SPSR & _BV(SPIF)));
    return SPDR;
}

uint8_t addr[5];

void setup(void) {
    /* Interrupts setup (falling edge on INT0, since the IRQ pin is
     * active low) */
    EICRA = 0x02; 		/* External Interrupt Control Register */
    EIMSK = 0x01;		/* External Interrupt Mask Register */

    //sys_init();


    sbi(DDRD, RELAY);
    sbi(PORTD, RELAY);
    // LED IO
    sbi(DDRB,  LED); // set LED pin as output
    sbi(PORTB, LED); // turn the LED on
    // SPI bus setup

    cbi(DDRB,  SPI_MISO); // MISO = input
    sbi(PORTB, SPI_MISO); // MISO = input with pullup on (DI)
    sbi(DDRB,  SPI_MOSI); // MOSI = output
    sbi(DDRB,  SPI_CLK);  // SCK  = output
    // nRF24L01+ (Chip enable activates Rx or Tx mode)
    sbi(DDRB,  NRF_CS);   // CS   = output
    sbi(DDRD,  NRF_CE);   // CE   = output
    sbi(PORTB, NRF_CS);

    // set as master
    sbi(SPCR, MSTR);
    // set clock as f_osc / 16 = 500kHz if 8MHz clock
    sbi(SPCR, SPR0);
    // enable SPI
    sbi(SPCR, SPE);
    /* Module setup */
    _NRF_CS_L;
    spi_transfer(NRF_W_REGISTER | NRF_RF_SETUP);
    spi_transfer(0x06);		/* 1Mbps, 0db */
    _NRF_CS_H;

    //DDRB ^= 1<<LED;
    _NRF_CS_L;
    spi_transfer(NRF_W_REGISTER | NRF_RF_CH);
    spi_transfer(0x40);		/* 2.4 GHz + 64 MHz */
    _NRF_CS_H;


    // Address width -> 5 bytes by default. In this case: 0xB3B3B3B3B3


    /* // SPI : write NRF Rx Addr P0 for auto ACK */
    _NRF_CS_L;
    spi_transfer(NRF_W_REGISTER | NRF_RX_ADDR_P0);
    spi_transfer(0xB3);
    spi_transfer(0xB3);
    spi_transfer(0xB3);
    spi_transfer(0xB3);
    spi_transfer(0xB3);
    _NRF_CS_H;


    sei();
}

void loop() {
    // SPI : write NRF default config : POWER_UP and EN_CRC / PWR_RX disable
    _NRF_CS_L;
    spi_transfer(NRF_W_REGISTER | NRF_CONFIG);
    spi_transfer(NRF_RX_CONF);
    _NRF_CS_H;

    _NRF_CS_L;
    spi_transfer(NRF_W_REGISTER | NRF_RX_PW_P0);
    spi_transfer(0x01);
    _NRF_CS_H;

    /* Enter RX Mode */
    _NRF_CE_H;
    _delay_us(200);		/* Time the chip takes to start listening */

    _delay_ms(100);

}

int main(void) {
    setup();
    for (; ; ) {
	loop();
    }
};
